import './App.css';
import Game from './Game'

function App() {
  return (
    <div className="App">
      <header className="textBox">
        <h1>איך משחקים</h1>
        <p>
          בשביל להתחיל לשחק צריך לקבוע מילה סודית. <br/>
          ניתן לראות את המספר של המילה הסודית של היום למטה, אך אפשר לשנות את המספר בעצמכם כדי לקבל מילה סודית אחרת. <br/>
          כדי לחזור למילה הסודית של היום ניתן ללחוץ על הכפתור שכתוב עליו 'יומי'.
        </p>
        <p>
            לאחר שקבעתם מילה סודית, מטרתכם היא למצוא אותה! <br/>
            לשם כך, אתם יכולים לשאול כמה קרובה מילה שאתם בוחרים למילה הסודית. כדי לעשות זאת, רשמו את המילה שלכם במלבן התחתון, ולחצו על נחש. <br/>
            אתם תראו את הניחוש שלכם מצטרף לטבלה, ושם יינתן ציון מספרי למילה. ציון גבוה אומר שהמילה שלכם קרובה מאוד למילה הסודית, וציון נמוך אומר בדיוק ההפך. <br/>
            שימו לב, דמיון הוא לרוב דמיון במשמעות, ולא דמיון באותיות, כך שאפילו המילה שהכי קרובה למילה הסודית יכולה להשתמש באותיות שונות לחלוטין, אך הן אמורות להיות דומות במשמעותן. <br/>
            בנוסף, ניתן להכניס רק מילה אחת, ולא משפט שלם, ואפילו אז ייתכן שהמילה שהכנסתם לא נמצאת במילון בשרת. המילה הסודית היא תמיד מילה פשוטה יחסית והיא תמיד בעברית.
        </p>
        <p>
            לראשותכם כפתור רמזים שיבקש מהשרת רמז על המילה הסודית. הרמז יכול להיות מספר האותיות במילה, לספר לכם על אות שנמצאת במילה הסודית, ועוד. שימו לב, יש מספר סופי של רמזים אפשריים עבור כל מילה, ושינוי המספר של המילה הסודית יאפס את הרמזים.
        </p>
      </header>
      <main id="Game">
        <Game />
      </main>
      <footer className="textBox">
        <h1>מידע</h1>
        <p>
            כדי למדוד את הדמיון בין שתי מילים אנחנו משתמשים במודל בסגנון WORD2VEC. הוא מקבל כקלט מילה, ומחזיר שיכון של המילה, כלומר רצף של 100 מספרים שמייצגים את המילה בצורה שאמורה לשמר דימיון בין מילים, כלומר מילים דומות ייקבלו ייצוגים דומים. <br/>
            המודל הזה אומן על ידי רון שמש, וכל הקרדיט על כך הולך אליו. <a href="https://github.com/Ronshm/hebrew-word2vec">הנה קישור לקוד המקורי שערכתי בשביל המשחק</a>. <br/>
            בשביל מידע נוסף על WORD2VEC כדאי לקרוא בעמוד הויקיפדיה <a href="https://he.wikipedia.org/wiki/Word2vec">הזה</a> (יש יותר פירוט בעמוד באנגלית). <br/>
                 
        </p>
        <p>
            את קוד השרת כתבתי בפייתון וניתן לראות אותו <a href="https://github.com/orijer/GuessTheWordBackend">פה</a>. אני משתמש ברמה החינמית של <a href="https://render.com/">render</a> כדי לאחסן אותו, ולכן הוא עלול לקרוס מידי פעם או לענות לאט אם לא שלחו לו הודעה כבר הרבה זמן. <br />
            את האתר עצמו כתבתי ב- REACT ואיחסנתי ישירות בעזרת GITHUB PAGES.
        </p>
      </footer>
    </div>
  );
}

export default App;
